Revit 2026 API

# FamilyInstanceCreationData Methods

---

The FamilyInstanceCreationData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FamilyInstanceCreationData Class

Autodesk.Revit.Creation Namespace